my_list = [1, 2, 3]  # создаем список
print(my_list)  # показываем список

my_list[0] = 100  # меняем первое значение списка
print(my_list)  # опять выводим список
# список меняется, потому что он изменяем  

my_tuple = (1, 2, 3) # создаём кортеж
print(my_tuple)  # показываем кортеж
my_tuple[0] = 100 # ну надо изменить первое значение 
print (my_tuple) 
# возникает ошибка
# короче, кортеж нельзя изменять после его создания 

my_string = "cat" # делаем строку
print(my_string)  # выводим строку
# my_string[0] = 'b'  # пытаемся   заменить первую букву
# возникает ошибка
# строки неизменяемые, крч, отдельный символ заменить нельзя  


